In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

from numpy.random import randn

In [2]:
ser1 = Series([1,2,3,4],index=["A","B","C","D"])
ser1

A    1
B    2
C    3
D    4
dtype: int64

REINDEX

In [3]:
ser2 = ser1.reindex(["A","B","C","D","E"])
ser2

A    1.0
B    2.0
C    3.0
D    4.0
E    NaN
dtype: float64

In [5]:
ser2.reindex(["A","B","C","D","E","F"],fill_value=0)

A    1.0
B    2.0
C    3.0
D    4.0
E    NaN
F    0.0
dtype: float64

In [6]:
ser3 = Series(["USA","Canada","China"],index=[0,5,10])
ser3

0        USA
5     Canada
10     China
dtype: object

In [7]:
ranger = range(15)

In [8]:
ranger

range(0, 15)

In [9]:
ser3.reindex(ranger,method="ffill")

0        USA
1        USA
2        USA
3        USA
4        USA
5     Canada
6     Canada
7     Canada
8     Canada
9     Canada
10     China
11     China
12     China
13     China
14     China
dtype: object

In [11]:
dframe = DataFrame(randn(25).reshape((5,5)),index=["A","B","C","D","E"],columns=["col1","col2","col3","col4","col5"])
dframe

       col1      col2      col3      col4      col5
A -0.831348  1.039681 -0.173524 -0.412948  0.128188
B -0.347464  2.753304  0.449727 -0.148722  0.082884
C -1.296926 -0.141687  1.730601 -0.186419 -0.397365
D  0.667641 -1.378881  1.193642 -0.588367 -0.146090
E  0.339939 -1.317381  1.532090  1.314332  0.902962

In [12]:
dframe2 = dframe.reindex(["A","B","G","C","D","E"])
dframe2

       col1      col2      col3      col4      col5
A -0.831348  1.039681 -0.173524 -0.412948  0.128188
B -0.347464  2.753304  0.449727 -0.148722  0.082884
G       NaN       NaN       NaN       NaN       NaN
C -1.296926 -0.141687  1.730601 -0.186419 -0.397365
D  0.667641 -1.378881  1.193642 -0.588367 -0.146090
E  0.339939 -1.317381  1.532090  1.314332  0.902962

In [13]:
new_columns = ["col1","col2","col3","col4","col5","col6"]

In [14]:
dframe2.reindex(columns=new_columns)

       col1      col2      col3      col4      col5  col6
A -0.831348  1.039681 -0.173524 -0.412948  0.128188   NaN
B -0.347464  2.753304  0.449727 -0.148722  0.082884   NaN
G       NaN       NaN       NaN       NaN       NaN   NaN
C -1.296926 -0.141687  1.730601 -0.186419 -0.397365   NaN
D  0.667641 -1.378881  1.193642 -0.588367 -0.146090   NaN
E  0.339939 -1.317381  1.532090  1.314332  0.902962   NaN

DROPPING

In [15]:
my_ser1 = Series(np.arange(3),index=["a","b","c"])
my_ser1

a    0
b    1
c    2
dtype: int32

In [16]:
my_ser1.drop("b")

a    0
c    2
dtype: int32

In [17]:
my_dframe = DataFrame(np.arange(9).reshape((3,3)),index=["SF","LA","NY"],columns=["pop","size","year"])
my_dframe

    pop  size  year
SF    0     1     2
LA    3     4     5
NY    6     7     8

In [18]:
my_dframe.drop("LA")

    pop  size  year
SF    0     1     2
NY    6     7     8

In [19]:
my_dframe

    pop  size  year
SF    0     1     2
LA    3     4     5
NY    6     7     8

In [20]:
my_dframe.drop("year",axis=1)

    pop  size
SF    0     1
LA    3     4
NY    6     7

SORTING

In [23]:
sort_series = Series(range(4),index=["D","B","C","A"])
sort_series

D    0
B    1
C    2
A    3
dtype: int64

In [24]:
sort_series.sort_index()

A    3
B    1
C    2
D    0
dtype: int64

In [27]:
from numpy.random import randn

In [28]:
ser_nums = Series(randn(10))
ser_nums

0   -0.392085
1   -0.771190
2   -0.245924
3   -1.426015
4    1.339977
5   -0.463654
6   -0.540385
7    0.582039
8    0.420189
9    1.534607
dtype: float64

In [31]:
ser_nums.sort_values()

3   -1.426015
1   -0.771190
6   -0.540385
5   -0.463654
0   -0.392085
2   -0.245924
8    0.420189
7    0.582039
4    1.339977
9    1.534607
dtype: float64

STATISTICS

In [32]:
arr = np.array([[1,2,np.nan],[np.nan,3,4]])

In [34]:
df1 = DataFrame(arr, index=["A","B",],columns=["One","Two","Three"])
df1

   One  Two  Three
A  1.0  2.0    NaN
B  NaN  3.0    4.0

In [35]:
df1.sum()

One      1.0
Two      5.0
Three    4.0
dtype: float64

In [36]:
df1.sum(axis=1)

A    3.0
B    7.0
dtype: float64

In [37]:
df1.min()

One      1.0
Two      2.0
Three    4.0
dtype: float64

In [38]:
df1.idxmin()

One      A
Two      A
Three    B
dtype: object

In [39]:
df1.describe()

       One       Two  Three
count  1.0  2.000000    1.0
mean   1.0  2.500000    4.0
std    NaN  0.707107    NaN
min    1.0  2.000000    4.0
25%    1.0  2.250000    4.0
50%    1.0  2.500000    4.0
75%    1.0  2.750000    4.0
max    1.0  3.000000    4.0

In [40]:
data = Series(["One","Two",np.nan,"Four"])
data

0     One
1     Two
2     NaN
3    Four
dtype: object

In [41]:
data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

MISSING VALUES

In [42]:
data.dropna()

0     One
1     Two
3    Four
dtype: object

In [43]:
df2 = DataFrame([[1,2,3],[np.nan,5,6],[7,np.nan,8],[np.nan,np.nan,np.nan]])
df2

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  8.0
3  NaN  NaN  NaN

In [44]:
clean_df2 = df2.dropna()
clean_df2

     0    1    2
0  1.0  2.0  3.0

In [45]:
df2.dropna(how="all")

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  8.0

In [46]:
df2.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [47]:
df2.fillna(1)

     0    1    2
0  1.0  2.0  3.0
1  1.0  5.0  6.0
2  7.0  1.0  8.0
3  1.0  1.0  1.0